[
    {"name": "", "text": "Diabolos seem weaker and can't move around."},
    {"name": "Student", "text": "I will end this!"},
    {"name": "", "text": "Student charged in and aimed for its core"},
    {"name": "", "text": "Fwoop...!"},
    {"name": "", "text": "Diabolos got stapped thorugh his core"},
    {"name": "Diabolos", "text": "Arghhhh!!!!"},
    {"name": "", "text": "The body of Joseph fall down"},
    {"name": "Joseph", "text": "Arghhhh!!!!"},
    {"name": "", "text": "..."},
    {"name": "Joseph", "text": "kid..."},
    {"name": "", "text": "Joseph return his consciousness and slowly talk to student."},
    {"name": "", "text": "He hand over student something from his pocket"},
    {"name": "Joseph", "text": "It seem... the core of this monster is what made this incident."},
    {"name": "Joseph", "text": "I want you to use that germicide to this core"},
    {"name": "Joseph", "text": "So we can permanently defeat this monster, I want you to do it."},
    {"name": "Student", "text": "Mr. Joseph..."},
    {"name": "Joseph", "text": "Please!"},
    {"name": "Student", "text": "Yeah... I will do it."},
    {"name": "", "text": "Student penetrate the core of monster with the dose full of germicide."},
    {"name": "", "text": "the core, its start to dispose itself... until there's nothing left from the place it was before."},
    {"name": "Student", "text": "Mr. Joseph, what about you?"},
    {"name": "Student", "text": "Why at that time... you push me away... Why..."},
    {"name": "Student", "text": "Why you have to protect me?"},
    {"name": "Joseph", "text": "I know, but I couldn't let it to you. I'll do whatever it takes to protect you."},
    {"name": "Student", "text": "But you'll get hurt! Please..."},
    {"name": "Joseph", "text": "I can't. I promised myself that I would never let anything happen to you. And I intend to keep that promise, even if it costs me my life."},
    {"name": "Student", "text": "No, Joseph, don't say that! You're going to make it out of here alive, I know it!"},
    {"name": "Joseph", "text": "Thank you for your faith in me. But in case anything happens, I just want you to know that you are all like family to me."},
    {"name": "Joseph", "text": "And I'm honored to have been able to protect you."},
    {"name": "Student", "text": "Mr. Joseph, I don't want to lose you. Please..."},
    {"name": "Joseph", "text": "I won't. But I can't just stand by and watch while you're in danger. Just promise me that you'll be safe, no matter what."},
    {"name": "joseph", "text": "That is what adult should do to protect their children."},
    {"name": "Student", "text": "I promise, and I'll never forget what you did for me."},
    {"name": "Student", "text": "I want to be like you someday."},
    {"name": "Joseph", "text": "That's all I could ask for. Now, let's get out of here together."},
]