[
    {"name": "Joseph", "text": "There you are."},
    {"name": "Joseph", "text": "So I will start introduce you how we can classify the material."},
    {"name": "Joseph", "text": "As you can see, the bins are distribute into 5 types based on the dangerous each materials are."},
    {"name": "Joseph", "text": "by the green one is organic, you can put every food waste into this bin."},
    {"name": "Joseph", "text": "Next one, the blue bin is used to store plastic or whatever trash that can't re-use."},
    {"name": "Joseph", "text": "Yellow is for recycle, you can toss up plastic can, or bottles in here."},
    {"name": "Joseph", "text": "Red bin is where we put all the dangerous and chemical stuff into it."},
    {"name": "Joseph", "text": "You have to be careful on this kind of trash, OK?"},
    {"name": "Joseph", "text": "You don't want yourself to be burn or cut."},
    {"name": "Joseph", "text": "Finally the last bin, the orange is where you must have the most caution."},
    {"name": "Joseph", "text": "This is where the infected trash full of virus belong to."},
    {"name": "Joseph", "text": "You need to read how to toss the trash correctly."},
    {"name": "Joseph", "text": "Or else, you may got yourself a fever or worst."},
    {"name": "Joseph", "text": "Now try to sort it out yourself."},
    {"name": "Joseph", "text": "Brilliant."},
    {"name": "Joseph", "text": "As for the reward, since the government would be glad for your corporation."},
    {"name": "Joseph", "text": "They will provide you with a supplies and money."},
    {"name": "Joseph", "text": "That would be enough for you now."},
    {"name": "Joseph", "text": "if you still want to continue helping us, then I would like you to accompany me to waste-sroting factory."},
    {"name": "Student", "text": "Why we have to go waste-sorting factory?"},
    {"name": "Student", "text": "You know that I have a class to attend as well right?"},
    {"name": "Student", "text": "I don't think I have time for that sort of thing."},
    {"name": "Joseph", "text": "How can you grow up to be this kind of kid huh?"},
    {"name": "Joseph", "text": "We need to tell them how to adapt into this situation."},
    {"name": "Joseph", "text": "And what type of school would still on open at this situation."},
    {"name": "Student", "text": "I don't have any choices huh."},
    {"name": "Student", "text": "find! I'll go with you."}
]