[
    {"name": "", "text": "Kaboom!"},
    {"name": "Student", "text": "What is that sound?"},
    {"name": "", "text": "Looking for the source of the noise"},
    {"name": "Student", "text": "What is happening at the can-factory over there, why there are such creatures leaking out of the bin?"},
    {"name": "Can_Monster", "text": "Uwarggggg!"},
    {"name": "", "text": "Can-Monster charging in"},
    {"name": "", "text": "Battle begins"},
    {"name": "Student", "text": "What is that thing? Why its attacking me."},
    {"name": "Student", "text": "What do want huh!"},
    {"name": "", "text": "NPC-stranger walk in"},
    {"name": "Stranger", "text": "Are you alright student?"},
    {"name": "Student", "text": "Don't mind me but what is that thing?"},
    {"name": "Stranger", "text": "That thing... it used to be a can."},
    {"name": "Student", "text": "A can?!"},
    {"name": "Stranger", "text": "Yes, it was once. Did you listen to the news talked about chemicalX recently."},
    {"name": "Student", "text": "ChemicalX? I haven't heard of that before."},
    {"name": "Stranger", "text": "It is the new chemistry med used in waste dissolving."},
    {"name": "Stranger", "text": "But it is not stable, so it seems the dissolving turn up side down and give birth to the creature you just saw."},
    {"name": "Student", "text": "What the goverment is doing then?"},
    {"name": "Student", "text": "Did they don't care about us or what?"},
    {"name": "Stranger", "text": "They are currently try to find a way to solve that problem but now they only know how to prevent its expansion and mutation."},
    {"name": "Stranger", "text": "You just have to sort the waste into the right bin. Since the more type of waste, the more type of that monsters can evolve."},
    {"name": "Stranger", "text": "By sorting it beforehand, the government can easily take care of the terapy of each type of monster."},
    {"name": "Student", "text": "But, I am just student, do I have to look over that task?"},
    {"name": "Student", "text": "Is that what adult have to take care of don't you think?"},
    {"name": "Stranger", "text": "It doesn't matter who you are. It is what we, the people of this city should have in mine."},
    {"name": "Stranger", "text": "Once we live on this peachful town, Don't you as well want this palce to still the same, huh?"},
    {"name": "Student", "text": "..."},
    {"name": "Student", "text": "But I don't sure how to group out those waste."},
    {"name": "Student", "text": "I mean..."},
    {"name": "Student", "text": "Why I have to do it anyway."},
    {"name": "Stranger", "text": "You don't have to worry about that youngman, this is why I am here."},
    {"name": "Stranger", "text": "Let me introduce myself, my name is Joseph, one of the government's waste medication association officer."},
    {"name": "Joseph", "text": "Let's begin our journey"},
    {"name": "Joseph", "text": "First, I want you to find a place we can toss out the material we got from the monster earlier in to the right bin."},
    {"name": "Joseph", "text": "So that we can send the government needed material"},
    {"name": "Joseph", "text": "We will meet there."}
]